USERS_MAP = { # ユーザー略語の定義
    "A-SKNIA": "あめりか",
    "KNUntk-KNU": "ぐーぐる",
    "KAUn-TAntk": "こんぴゅーたー",
    "SKNIA-SAUtk": "めそっど",
    "TNIA-SNI": "でじたる",
    "SU-STKNAU": "すまーとふぉん",
    "SU-TKAU": "すまほ",
    "STKU-STA": "ぷらすちっく",
    "KI-TKNAU": "きーぼーど",
    "In-STA": "いんふら",
    "KAUn-TKNIn": "こんびに",
    "SI-KNAUt": "しごと",
    "SI-SU": "しすてむ",
    "SAU-TKUt": "そふと",
    "SAU-SKIA": "そふとうぇあ",
    "TKA-SKIA": "はーどうぇあ",
    "In-NIAtk": "いんたーねっと",
    "In-STKNAU": "いんふぉめーしょん",
    "KAU-SKNYU": "こみゅにけーしょん",
    "SI-SKNYU": "しみゅれーしょん",
    "IU-STU": "ういるす",
    "KAU-IU": "ころなういるす",
    "SIn-KNAt": "しんがた",
    "A-STI": "ありがとう",
    "AU-NIA": "おねがい",
    "YAU-STAU": "よろしく",
    "TA-TAU": "たとえば",
    "KNU-TY": "ぐたいてきには",
    "TA-SI": "たしかに",
}
ABSTRACT_MAP = { # 一般略語の定義
  "YAU-STIA": "あれ",
  "KAU-STIA": "これ",
  "SAU-STIA": "それ",
  "TNAU-STIA": "どれ",
  "TNA-STIA": "だれ",
  "A-TNA": "あれだけ",
  "KAU-TNA": "これだけ",
  "SAU-TNA": "それだけ",
  "TNAU-TNA": "どれだけ",
  "TNA-TNA": "だれだけ",
  "A-IU": "ああいう",
  "KAU-IU": "こういう",
  "SAU-IU": "そういう",
  "TNAU-IU": "どういう",
  "TAU-IU": "という",
  "NA-IU": "なんていう",
  "TAU-KAU": "ところ",
  "KAU-TAU": "こと",
  "TKI-TAU": "ひと",
  "TAU-KI": "とき",
  "SKNAU-NAU": "もの",
  "TKNIA-TIA": "すべて",
  "NA-KNA": "ながら",
  "AU-KA": "おかげ",
  "SI-KNAU": "しごと"
}

ABSTRACT_MAP_LEFT = { # 一般略語の左側ストローク定義
  "STN": "",
  "YIAU": "あの",
  "KIAU": "この",
  "SIAU": "その",
  "TIAU": "との",
  "TNIAU": "どの",
  "NIAU": "なんの",
  "IU": "いう",
  "YIU": "ああいう",
  "KIU": "こういう",
  "SIU": "そういう",
  "TNIU": "どういう",
  "TIU": "という",
  "NIU": "なんていう"
}

ABSTRACT_MAP_RIGHT = { # 一般略語の右側ストローク定義
  "STN": "",
  "KAU": "こと",
  "STAU": "ころ",
  "KI": "とき",
  "TAU": "ところ",
  "TKI": "ひと",
  "TKA": "はなし",
  "TKIAU": "ほう",
  "SKNAU": "もの",
  "KNAU": "ものごと",
  "SI": "しごと",
}

VERB_GODAN_MAP = { # ストローク: [語幹, 行]
    "A-STU": ["ある", 'k'],# 歩く
#   "I-TNA": ["いだ", 'k'],# 抱く
    "I-TNA": ["いただ", 'k'],# 頂く (例外)
    "U-KNAU": ["うご", 'k'],# 動く
    "KA-YA": ["かがや", 'k'],# 輝く (例外)
    "KI-TU": ["きがつ", 'k'],# 気が付く (例外)
    "KI-TNU": ["きづ", 'k'],# 気付く
    "SI-KNAU": ["しご", 'k'],# 扱く
    "TA-TA": ["たた", 'k'],# 叩く
    "TN-KU": ["つづ", 'k'],# 続く (例外)
    "NAU-SNAU": ["のぞ", 'k'],# 除く
    "TKA-STA": ["はたら", 'k'],# 働く (例外)
    "SKNI-KNA": ["みが", 'k'],# 磨く
    "I-SAU": ["いそ", 'g'],# 急ぐ
#   "AU-YAU": ["およ", 'g'],# 泳ぐ
    "KA-SIA": ["かせ", 'g'],# 稼ぐ
    "KA-TU": ["かつ", 'g'],# 担ぐ
    "SA-SA": ["ささ", 'g'],# 捧ぐ
    "SA-SKA": ["さわ", 'g'],# 騒ぐ
    "TU-NA": ["つな", 'g'],# 繋ぐ
    "TKU-SA": ["ふさ", 'g'],# 塞ぐ
    "TKU-SIA": ["ふせ", 'g'],# 防ぐ
    "A-KA": ["あか", 's'],# 明かす
    "I-KA": ["いか", 's'],# 活かす
    "I-TA": ["いた", 's'],# 致す
    "AU-TAU": ["おと", 's'],# 落とす
    "KA-KA": ["かか", 's'],# 欠かす
    "KA-KU": ["かく", 's'],# 隠す
    "KU-STA": ["くら", 's'],# 暮らす
    "KAU-STAU": ["ころ", 's'],# 殺す
    "KAU-SKA": ["こわ", 's'],# 壊す
    "TA-AU": ["たお", 's'],# 倒す
    "TU-TKNU": ["つぶ", 's'],# 潰す
    "TIA-STA": ["てら", 's'],# 照らす
    "NA-AU": ["なお", 's'],# 直す
    "NI-KNA": ["にが", 's'],# 逃がす
    "NAU-KAU": ["のこ", 's'],# 残す
    "NAU-TKNA": ["のば", 's'],# 伸ばす
    "TKA-NA": ["はな", 's'],# 話す
    "SKNA-KA": ["まか", 's'],# 任す
    "SKNI-NA": ["みな", 's'],# 見なす
    "YU-STA": ["ゆら", 's'],# 揺らす
    "SKA-TA": ["わた", 's'],# 渡す
    "U-KNA": ["うが", 't'],# 穿つ
    "SAU-TNA": ["そだ", 't'],# 育つ
    "TA-SKNAU": ["たも", 't'],# 保つ
#   "TKA-NA": ["はな", 't'],# 放つ
    "SKNIA-TNA": ["めだ", 't'],# 目立つ
#   "SKA-KA": ["わか", 't'],# 分つ
    "A-SAU": ["あそ", 'b'],# 遊ぶ
    "IA-STA": ["えら", 'b'],# 選ぶ
    "AU-YAU": ["およ", 'b'],# 及ぶ
    "KAU-STAU": ["ころ", 'b'],# 転ぶ
    "NA-STA": ["なら", 'b'],# 並ぶ
    "TKA-KAU": ["はこ", 'b'],# 運ぶ
    "TKAU-STAU": ["ほろ", 'b'],# 滅ぶ
    "SKNA-NA": ["まな", 'b'],# 学ぶ
    "SKNU-SU": ["むす", 'b'],# 結ぶ
    "YAU-STAU": ["よろこ", 'b'],# 喜ぶ (例外)
    "I-NA": ["いな", 'm'],# 否む
    "U-STA": ["うらや", 'm'],# 羨む (例外)
    "KA-KNA": ["かが", 'm'],# 屈む
    "KA-SU": ["かす", 'm'],# 霞む
    "SU-SU": ["すす", 'm'],# 進む
    "TA-NAU": ["たの", 'm'],# 頼む
    "TIU-TKNA": ["ついば", 'm'],# 啄む
#   "TU-KA": ["つか", 'm'],# 掴む
    "TU-TU": ["つつ", 'm'],# 包む
    "TU-SKNA": ["つま", 'm'],# 摘む
    "NA-YA": ["なや", 'm'],# 悩む
    "NU-SU": ["ぬす", 'm'],# 盗む
    "NAU-SNAU": ["のぞ", 'm'],# 望む
    "TKA-SA": ["はさ", 'm'],# 挟む
    "TKA-STA": ["はら", 'm'],# 孕む
    "TKI-KAU": ["ひっこ", 'm'],# 引っ込む (っ省略)
    "TKU-KU": ["ふく", 'm'],# 含む
    "TKAU-TKAU": ["ほほえ", 'm'],# 微笑む (例外)
    "YA-SU": ["やす", 'm'],# 休む
    "I-": ["い", 'r'],# 要る (例外)
    "KA-KNI": ["かぎ", 'r'],# 限る
    "KNA-TKNA": ["がんば", 'r'],# 頑張る (ん省略)
    "KNA-": ["がんば", 'r'],# 頑張る (例外)
    "KIA-": ["け", 'r'],# 蹴る (例外)
    "SYA-TKNIA": ["しゃべ", 'r'],# しゃべる
    "SU-TKNIA": ["すべ", 'r'],# 滑る
    "T-KA": ["たすか", 'r'],# 助かる (例外)
    "NA-": ["な", 'r'],# なる (例外)
    "TKY-": ["はい", 'r'],# 入る (例外)
    "TKA-TKNA": ["はばか", 'r'],# 憚る (例外)
    "YA-": ["や", 'r'],# やる (例外)
    "-YA": ["や", 'r'],# やる (例外)
    "SKA-": ["わか", 'r'],# 分かる (例外)
    "-A": ["あ", 'w'],# 会う (例外)
    "A-STA": ["あら", 'w'],# 洗う
    "A-SAU": ["あらそ", 'w'],# 争う (例外)
    "IU-": ["い", 'w'],# 言う (例外)
    "I-SNA": ["いざな", 'w'],# 誘う (例外)
    "I-SKA": ["いわ", 'w'],# 祝う
    "U-SI": ["うしな", 'w'],# 失う (例外)
    "U-TA": ["うた", 'w'],# 歌う
    "U-KNA": ["うたが", 'w'],# 疑う (例外)
    "U-YA": ["うやま", 'w'],# 敬う (例外)
    "AU-SKNAU": ["おも", 'w'],# 思う
    "AU-": ["おも", 'w'],# 思う (例外)
    "KA-NA": ["かな", 'w'],# 叶う
    "KA-SKNA": ["かま", 'w'],# 構う
    "KU-STU": ["くる", 'w'],# 狂う
    "SI-A": ["しあ", 'w'],# 仕合う
#   "SI-TA": ["した", 'w'],# 慕う
    "SI-TA": ["したが", 'w'],# 従う (例外)
    "SI-SKNA": ["しま", 'w'],# 仕舞う
    "SAU-STAU": ["そろ", 'w'],# 揃う
    "TA-TA": ["たたか", 'w'],# 戦う (例外)
    "TI-KA": ["ちか", 'w'],# 誓う
    "TI-KNA": ["ちが", 'w'],# 違う
    "TU-KA": ["つか", 'w'],# 使う
    "TU-TI": ["つちか", 'w'],# 培う (例外)
    "TU-TNAU": ["つど", 'w'],# 集う
    "TIA-STA": ["てら", 'w'],# 衒う
    "TNIA-A": ["であ", 'w'],# 出会う
    "TAU-NA": ["ともな", 'w'],# 伴う (例外)
    "NA-STA": ["なら", 'w'],# 習う
    "NI-A": ["にあ", 'w'],# 似合う
    "NI-SKA": ["にぎわ", 'w'],# 賑わう (例外)
    "NIA-KNA": ["ねが", 'w'],# 願う
    "NAU-STAU": ["のろ", 'w'],# 呪う
    "TKA-STA": ["はら", 'w'],# 払う
    "TKI-STAU": ["ひろ", 'w'],# 拾う
    "SKNA-TAU": ["まと", 'w'],# 纏う
    "SKNI-A": ["みあ", 'w'],# 見合う
    "SKNU-KA": ["むか", 'w'],# 向かう
    "SKNAU-STA": ["もら", 'w'],# 貰う
    "SKA-STA": ["わら", 'w'],# 笑う
}
VERB_KAMI_MAP = { # ストローク: [語幹, 行]
    "TN-KI": ["で", 'k'],# 出来る (例外)
    "SI-SNI": ["しん", 'z'],# 信じる
    "KA-SNI": ["かん", 'z'],# 感じる
    "KI-SNI": ["きん", 'z'],# 禁じる
    "TNA-SNI": ["だん", 'z'],# 断じる
    "KA-SKNI": ["かんが", 'm'],# 鑑みる (例外)
}
VERB_SIMO_MAP = { # ストローク: [語幹, 行]
    "T-KIA": ["たす", 'k'],# 助ける (例外)
    "TU-TN": ["つづ", 'k'],# 続ける (例外)
    "TN-KIA": ["つづ", 'k'],# 続ける (例外)
    "K-KNIA": ["かか", 'g'],# 掲げる (例外)
    "SKNA-KA": ["まか", 's'],# 任せる
#   "SAU-TNA": ["そだ", 't'],# 育てる
    "TN-": ["", 'd'],# 出る (例外)
    "KU-STA": ["くら", 'b'],# 比べる
    "SA-TNA": ["さだ", 'm'],# 定める
    "TKA-SNI": ["はじ", 'm'],# 始める
    "SKNAU-TAU": ["もと", 'm'],# 求める
    "KAU-STIA": ["こわ", 'r'],# 壊れる (例外)
    "SKA-SU": ["わす", 'r'],# 忘れる
    "AU-SA": ["おさ", 'w'],# 抑える
    "AU-TKNAU": ["おぼ", 'w'],# 覚える
    "KA-KNA": ["かんが", 'w'],# 考える (ん省略)
    "KA-": ["かんが", 'w'],# 考える (例外)
    "KU-SKA": ["くわ", 'w'],# 加える
    "KAU-TA": ["こた", 'w'],# 答える
    "SA-SA": ["ささ", 'w'],# 支える
    "SKNA-KNA": ["まちが", 'w'],# 間違える (例外)
}