# Mejiro設定ファイル
# 変換ロジックや辞書の設定をここで行う

# 基本子音ストロークの定義
# (変更時は配列の右側のアルファベットを変更する)
# STKN
# ストローク -> 基本子音 (s, t, k, n, r, w, h, z, d, g, b, p, m, y, f, l)
conso_stroke_to_roma = [ # (ストローク, 子音)
    ["", ''], ["S", 's'], ["T", 't'], ["K", 'k'], ["N", 'n'],
    ["ST", 'r'], ["SK", 'w'], ["TK", 'h'],
    ["SN", 'z'], ["TN", 'd'], ["KN", 'g'], ["TKN", 'b'],
    ["STK", 'p'], ["STN", 'l'], ["SKN", 'm'], ["STKN", 'f']
]

# 基本母音ストロークの定義 (二重母音は除外)
# (変更時は配列の右側のアルファベットを変更する)
# YIAU
# ストローク -> 基本母音 (a, i, u, e, o, ya, yu, yo)
vowel_stroke_to_roma = [ # (ストローク, 母音)
    ['A', 'a'], ['I', 'i'], ['U', 'u'], ['IA', 'e'], ['AU', 'o'],
    ["YA", 'ya'], ["YU", 'yu'], ["YAU", 'yo']
]

# 行段のアルファベットからひらがなへのマッピング
ROMA_TO_KANA_MAP = {
    '':  ['あ', 'い', 'う', 'え', 'お', 'や', 'ゆ', 'よ'],
    'k': ['か', 'き', 'く', 'け', 'こ', 'きゃ', 'きゅ', 'きょ'],
    's': ['さ', 'し', 'す', 'せ', 'そ', 'しゃ', 'しゅ', 'しょ'],
    't': ['た', 'ち', 'つ', 'て', 'と', 'ちゃ', 'ちゅ', 'ちょ'],
    'n': ['な', 'に', 'ぬ', 'ね', 'の', 'にゃ', 'にゅ', 'にょ'],
    'h': ['は', 'ひ', 'ふ', 'へ', 'ほ', 'ひゃ', 'ひゅ', 'ひょ'],
    'm': ['ま', 'み', 'む', 'め', 'も', 'みゃ', 'みゅ', 'みょ'],
    'r': ['ら', 'り', 'る', 'れ', 'ろ', 'りゃ', 'りゅ', 'りょ'],
    'w': ['わ', 'うぃ', 'う', 'うぇ', 'うぉ', 'うぁ', 'う', 'を'],
    'g': ['が', 'ぎ', 'ぐ', 'げ', 'ご', 'ぎゃ', 'ぎゅ', 'ぎょ'],
    'z': ['ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'じゃ', 'じゅ', 'じょ'],
    'd': ['だ', 'ぢ', 'づ', 'で', 'ど', 'ぢゃ', 'ぢゅ', 'ぢょ'],
    'b': ['ば', 'び', 'ぶ', 'べ', 'ぼ', 'びゃ', 'びゅ', 'びょ'],
    'p': ['ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ぴゃ', 'ぴゅ', 'ぴょ'],
    'f': ['ふぁ', 'ふぃ', 'ふ', 'ふぇ', 'ふぉ', 'ふゃ', 'ふゅ', 'ふょ'],
    'l': ['ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ', 'ゃ', 'ゅ', 'ょ']
}

# 二重母音ストロークの定義（親指を使うものは除外）
# YIAU
DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    "Y": ("a", "い"), # あい
    "YI": ("yo", "う"), # よう
    "YIA": ("e", "い"), # えい
    "YIU": ("yu", "う"), # ゆう
    "YIAU": ("u", "う"), # うう
    "IU": ("u", "い"), # うい
    "IAU": ("o", "う"), # おう
}

# 親指も使ったマイナーな二重母音のストローク定義
MINOR_DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    "IAUtk": ("a", "う"),   # ~あう
    "YItk": ("i", "い"),    # ~いい
    "YIUtk": ("o", "い"),   # ~おい
    "YIAtk": ("a", "え"),   # ~あえ
    "YIAUtk": ("o", "お"),  # ~おお
}

# 親指も使った外来音ストロークの定義
# YIAUntk
ENGLISH_DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)

# |V/C | t | k |  nt   | nk | ntk|
# |----|---|---|-------|----|----|
# |IAU |~as|~al|~ation |~ind|~arn|
# |YI  |~is|~il|~ition |~ing|~een|
# |YIU |~us|~ul|~usion |~and|~oom|
# |YIA |~es|~el|~ention|~end|~ain|
# |YIAU|~os|~ol|~otion |~ong|~orn|

    # t
    "IAUt": ("a", "す"),   # ~as
    "YIt": ("i", "す"),    # ~is
    "YIUt": ("u", "す"),   # ~us
    "YIAt": ("e", "す"),   # ~es
    "YIAUt": ("o", "す"),  # ~os

    # k
    "IAUk": ("a", "る"),   # ~al
    "YIk": ("i", "る"),    # ~il
    "YIUk": ("u", "る"),   # ~ul
    "YIAk": ("e", "る"),   # ~el
    "YIAUk": ("o", "る"),  # ~ol

    # nt
    "IAUnt": ("e", "ーしょん"),  # ~ation
    "YInt": ("i", "しょん"),     # ~ition
    "YIUnt": ("u", "しょん"),    # ~usion
    "YIAnt": ("e", "んしょん"),  # ~ention
    "YIAUnt": ("o", "ーしょん"), # ~otion

    # nk
    "IAUnk": ("a", "いんど"),# ~ind
    "YInk": ("i", "んぐ"),   # ~ing
    "YIUnk": ("a", "んど"),  # ~and
    "YIAnk": ("e", "んど"),  # ~end
    "YIAUnk": ("o", "んぐ"), # ~ong

    # ntk
    "IAUntk": ("a", "ーん"),  # ~arn
    "YIntk": ("i", "ーん"),   # ~een
    "YIUntk": ("u", "ーん"),  # ~oom
    "YIAntk": ("e", "ーん"),  # ~ain
    "YIAUntk": ("o", "ーん"), # ~orn
}

EXCEPTION_KANA_MAP = { # 例外的なかなのマッピング

#  |U  |YA |YI |YU  |YIU|YAU|YIAU|IAU|IU  |Y   |YIA
# -|---|---|---|----|---|---|----|---|----|----|----
# F|vu |va |vi |fyu |ve |vo |jei |je |vyu |----|----
# W|xwa|wha|wyi|yui |wye|wo |chei|che|iu  |----|----
# D|---|thi|twu|dhu |dwu|dhi|ye  |---|thu |----|----
# X|---|sta|sti|sthi|ste|sto|shei|she|kusu|stai|stei

    # F
    "STKNU": "ゔ",
    "STKNYA": "ゔぁ",
    "STKNYI": "ゔぃ",
    "STKNYU": "ふゅ",
    "STKNYIU": "ゔぇ",
    "STKNYAU": "ゔぉ",
    "STKNYIAU": "じぇい",
    "STKNIAU": "じぇ",
    "STKNIU": "ゔゅ",

    # W
    "SKU": "ゎ",
    "SKYA": "うぁ",
    "SKYI": "ゐ",
    "SKYU": "ゆい",
    "SKYIU": "ゑ",
    "SKYAU": "を",
    "SKYIAU": "ちぇい",
    "SKIAU": "ちぇ",
    "SKIU": "いう",

    # D
    "TNYA": "てぃ",
    "TNYI": "とぅ",
    "TNYU": "でゅ",
    "TNYIU": "どぅ",
    "TNYAU": "でぃ",
    "TNYIAU": "いぇ",
    "TNIU": "てゅ",

    # X
    "STNYA": "すた",
    "STNYI": "すち",
    "STNYU": "すてぃ",
    "STNYIU": "すて",
    "STNYAU": "すと",
    "STNYIAU": "しぇい",
    "STNIAU": "しぇ",
    "STNIU": "くす",
    "STNY": "すたい",
    "STNYIA": "すてい",
}

# 助詞のキーと対応する文字列の定義
PARTICLE_KEY_LIST = ["", "n", "t", "k", "tk", "nt", "nk", "ntk"]
# 追加音の定義
SECOND_SOUND_LIST = ["", "ん", "つ", "く", "っ", "ち", "き", "ー"]

# ドット、コンマの定義(変換コマンドはオプションです)
DOT = "。" # or "."
COMMA = "、" # or ","

# 左側の助詞文字列の定義
L_PARTICLE = ["", COMMA, "に", "の", "で", "と", "を", "へ"]

# 右側の助詞文字列の定義
R_PARTICLE = ["", COMMA, "は", "が", "も", "は" + COMMA, "が" + COMMA, "も" + COMMA]

# 例外的な助詞ストロークのマッピング
EXCEPTION_STROKE_MAP = {
    "-n": "}{#Return}{", "n-": "}{#Space}{", "n-n": "}{#Tab}{",
    "-nt": DOT, "-nk": COMMA, "-ntk": "}{#F7}{",
    "n-nt": "?", "n-nk": "!", "n-ntk": "}{#F8}{",
}
