# Mejiro設定ファイル
# 変換ロジックや辞書の設定をここで行う

# 基本子音ストロークの定義
# (変更時は配列の右側のアルファベットを変更する)
# STKN
# ストローク -> 基本子音 (s, t, k, n, r, w, h, z, d, g, b, p, m, y, f, l)
conso_stroke_to_roma = [ # (ストローク, 子音)
    ["", ''], ["S", 's'], ["T", 't'], ["K", 'k'], ["N", 'n'], 
    ["ST", 'r'], ["SK", 'w'], ["TK", 'h'],
    ["SN", 'z'], ["TN", 'd'], ["KN", 'g'], ["TKN", 'b'],
    ["STK", 'p'], ["STN", 'l'], ["SKN", 'm'], ["STKN", 'f']
]

# 基本母音ストロークの定義 (二重母音は除外)
# (変更時は配列の右側のアルファベットを変更する)
# YIAU
# ストローク -> 基本母音 (a, i, u, e, o, ya, yu, yo)
vowel_stroke_to_roma = [ # (ストローク, 母音)
    ['A', 'a'], ['I', 'i'], ['U', 'u'], ['IA', 'e'], ['AU', 'o'],
    ["YA", 'ya'], ["YU", 'yu'], ["YAU", 'yo']
]

# 行段のアルファベットからひらがなへのマッピング
ROMA_TO_KANA_MAP = {
    '':  ['あ', 'い', 'う', 'え', 'お', 'や', 'ゆ', 'よ'],
    'k': ['か', 'き', 'く', 'け', 'こ', 'きゃ', 'きゅ', 'きょ'],
    's': ['さ', 'し', 'す', 'せ', 'そ', 'しゃ', 'しゅ', 'しょ'],
    't': ['た', 'ち', 'つ', 'て', 'と', 'ちゃ', 'ちゅ', 'ちょ'],
    'n': ['な', 'に', 'ぬ', 'ね', 'の', 'にゃ', 'にゅ', 'にょ'],
    'h': ['は', 'ひ', 'ふ', 'へ', 'ほ', 'ひゃ', 'ひゅ', 'ひょ'],
    'm': ['ま', 'み', 'む', 'め', 'も', 'みゃ', 'みゅ', 'みょ'],
    'r': ['ら', 'り', 'る', 'れ', 'ろ', 'りゃ', 'りゅ', 'りょ'],
    'w': ['わ', 'うぃ', 'ゔ', 'うぇ', 'うぉ', 'わ', 'ゔゅ', 'を'],
    'g': ['が', 'ぎ', 'ぐ', 'げ', 'ご', 'ぎゃ', 'ぎゅ', 'ぎょ'],
    'z': ['ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'じゃ', 'じゅ', 'じょ'],
    'd': ['だ', 'ぢ', 'づ', 'で', 'ど', 'ぢゃ', 'ぢゅ', 'ぢょ'],
    'b': ['ば', 'び', 'ぶ', 'べ', 'ぼ', 'びゃ', 'びゅ', 'びょ'],
    'p': ['ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ぴゃ', 'ぴゅ', 'ぴょ'],
    'f': ['ふぁ', 'ふぃ', 'ふゅ', 'ふぇ', 'ふぉ', 'ふゃ', 'ふゅ', 'ふょ'],
    'l': ['ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ', 'ゃ', 'ゅ', 'ょ']
}

# 二重母音ストロークの定義（親指を使うものは除外）
# (変更時はマップの右側の配列のアルファベット・ひらがなを変更する)
# YIAU
DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    "Y": ("a", "い"), # あい
    "YI": ("yo", "う"), # よう
    "YIA": ("e", "い"), # えい
    "YIU": ("yu", "う"), # ゆう
    "YIAU": ("u", "う"), # うう
    "IU": ("u", "い"), # うい
    "IAU": ("o", "う"), # おう
}
# 親指も使った外来音ストロークの定義
# (変更時はマップの右側の配列のアルファベット・ひらがなを変更する)
# YIAUntk
COMPLEX_DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    # ～ん
    "IAUn": ("a", "うん"), # ~oun, ~own
    "YIn": ("i", "んぐ"), # ~ing
    "YIUn": ("ya", "る"), # ~ial
    "YIAUn": ("a", "る"), # ~al
    # ～っ
    "IAUtk": ("a", "う"), # ~ou, ~ow
    "YItk": ("i", "ずむ"), # ~ism
    "YIUtk": ("i", "すと"), # ~ist
    "Ytk": ("a", "いざ－"), # ~izer
    "YIAtk": ("e", "んす"), # ~ense, ~ence
    "YIAUtk": ("u", "る"), # ~ul
    # ～ー
    "IAUntk": ("a", "ぶる"), # ~able
    "YIntk": ("i", "かる"), # ~ical
    "YIUntk": ("i", "てぃ－"), # ~ity
    "YIAUntk": ("o", "じ－"), # ~ogy
}

EXCEPTION_KANA_MAP = { # 例外的なかなのマッピング
    "TNYI": "どぅ",
    "TNYIU": "とぅ",
    "TNYA": "てぃ",
    "TNYAU": "でぃ",
    "TNYU": "でゅ",
    "TNIU": "ちぇ",
    "TNYIAU": "てゅ",

    "SKYI": "ゐ",
    "SKYIU": "ゑ",
    "SKYA": "いぇ",
    "SKYAU": "を",
    "SKYU": "ゔゅ",
    "SKIU": "ゆい",
    "SKIAU": "ゎ",
    "SKYIAU": "うぁ",

    "STKNYI": "ゔぉ",
    "STKNYIU": "ゔぇ",
    "STKNYA": "しぇ",
    "STKNYAU": "じぇ",
    "STKNYU": "ゔぃ",
    "STKNIU": "ゔぁ",

    "STNIU": "つぃ",
    "STNIAU": "つぉ",
    "STNYIAU": "てゃ",
    "STNY": "つぁ",
    "STNYIA": "つぇ",
}

# 助詞のキーと対応する文字列の定義
PARTICLE_KEY_LIST = ["", "n", "t", "k", "tk", "nt", "nk", "ntk"]
# 追加音の定義
SECOND_SOUND_LIST = ["", "ん", "つ", "く", "っ", "ち", "き", "ー"]

# ドット、コンマの定義(変換コマンドはオプションです)
DOT = "。" # or "."
COMMA = "、" # or ","

# 左側の助詞文字列の定義
L_PARTICLE = ["", COMMA, "に", "の", "で", "と", "を", "へ"]

# 右側の助詞文字列の定義
R_PARTICLE = ["", COMMA, "は", "が", "も", "は" + COMMA, "が" + COMMA, "も" + COMMA]

# 例外的な助詞ストロークのマッピング
EXCEPTION_STROKE_MAP = {
    "-n": "}{#Return}{", "n-": "}{#Space}{", "n-n": "}{#Tab}{", 
    "-nt": DOT, "-nk": COMMA, "-ntk": "}{#F7}{",
    "n-nt": "?", "n-nk": "!", "n-ntk": "}{#F8}{",
}