# Mejiro設定ファイル
# 変換ロジックや辞書の設定をここで行う

# 基本子音ストロークの定義
# (変更時は配列の右側のアルファベットを変更する)
# STKN
# ストローク -> 基本子音 (s, t, k, n, r, w, h, z, d, g, b, p, m, y, f, l)
conso_stroke_to_roma = [ # (ストローク, 子音)
    ["",     '' ],
    ["S",    's'],
    ["T",    't'],
    ["K",    'k'],
    ["N",    'n'],
    ["ST",   'r'],
    ["SK",   'w'],
    ["TK",   'h'],
    ["SN",   'z'],
    ["TN",   'd'],
    ["KN",   'g'],
    ["TKN",  'b'],
    ["STK",  'p'],
    ["STN",  'l'],
    ["SKN",  'm'],
    ["STKN", 'f']
]

# 基本母音ストロークの定義 (二重母音は除外)
# (変更時は配列の右側のアルファベットを変更する)
# YIAU
# ストローク -> 基本母音 (a, i, u, e, o, ya, yu, yo)
vowel_stroke_to_roma = [ # (ストローク, 母音)
    ['A',   'a' ],
    ['I',   'i' ],
    ['U',   'u' ],
    ['IA',  'e' ],
    ['AU',  'o' ],
    ["YA",  'ya'],
    ["YU",  'yu'],
    ["YAU", 'yo']
]

# 行段のアルファベットからひらがなへのマッピング
ROMA_TO_KANA_MAP = {
    '' : ['あ',  'い',  'う',  'え',  'お',  'や',  'ゆ',  'よ'  ],
    'k': ['か',  'き',  'く',  'け',  'こ',  'きゃ','きゅ','きょ'],
    's': ['さ',  'し',  'す',  'せ',  'そ',  'しゃ','しゅ','しょ'],
    't': ['た',  'ち',  'つ',  'て',  'と',  'ちゃ','ちゅ','ちょ'],
    'n': ['な',  'に',  'ぬ',  'ね',  'の',  'にゃ','にゅ','にょ'],
    'h': ['は',  'ひ',  'ふ',  'へ',  'ほ',  'ひゃ','ひゅ','ひょ'],
    'm': ['ま',  'み',  'む',  'め',  'も',  'みゃ','みゅ','みょ'],
    'r': ['ら',  'り',  'る',  'れ',  'ろ',  'りゃ','りゅ','りょ'],
    'w': ['わ',  'うぃ','う',  'うぇ','うぉ','うぁ','う',  'を'  ],
    'g': ['が',  'ぎ',  'ぐ',  'げ',  'ご',  'ぎゃ','ぎゅ','ぎょ'],
    'z': ['ざ',  'じ',  'ず',  'ぜ',  'ぞ',  'じゃ','じゅ','じょ'],
    'd': ['だ',  'ぢ',  'づ',  'で',  'ど',  'ぢゃ','ぢゅ','ぢょ'],
    'b': ['ば',  'び',  'ぶ',  'べ',  'ぼ',  'びゃ','びゅ','びょ'],
    'p': ['ぱ',  'ぴ',  'ぷ',  'ぺ',  'ぽ',  'ぴゃ','ぴゅ','ぴょ'],
    'f': ['ふぁ','ふぃ','ふ',  'ふぇ','ふぉ','ふゃ','ふゅ','ふょ'],
    'l': ['ぁ',  'ぃ',  'ぅ',  'ぇ',  'ぉ',  'ゃ',  'ゅ',  'ょ'  ]
}

# 二重母音ストロークの定義（親指を使うものは除外）
# YIAU
DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    "Y"   : ("a",  "い"), # ~あい
    "YI"  : ("yo", "う"), # ~よう
    "YIA" : ("e",  "い"), # ~えい
    "YIU" : ("yu", "う"), # ~ゆう
    "YIAU": ("u",  "う"), # ~うう
    "IU"  : ("u",  "い"), # ~うい
    "IAU" : ("o",  "う"), # ~おう
}

# 親指も使ったマイナーな二重母音のストローク定義
MINOR_DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    # k
    "IAUk" : ("o",  "い"),   # ~おい
    "YIk"  : ("i",  "い"),   # ~いい
    "Yk"   : ("ya", "い"),   # ~やい
    "IUk"  : ("u",  "ぃ"),   # ~うぃ
    "YIUk" : ("yu", "い"),   # ~ゆい
    "YIAk" : ("i",  "ぇい"), # ~いぇい
    "YIAUk": ("yo", "い"),   # ~よい

    # t
    "IAUt" : ("ya", "う"  ), # ~やう
    "YIt"  : ("i",  "ぇ"  ), # ~いぇ
    "Yt"   : ("i", "あ"  ), # ~いあ
    "IUt"  : ("yo", "い"  ), # ~よい
    "YIUt" : ("yu", "い"  ), # ~ゆい
    "YIAt" : ("i",  "ぇ"), # ~いぇ
    "YIAUt": ("yo", "お" ), # ~よお

    # nk
    "IAUnk" : ("a", "うん"), # ~あうん
    "YInk"  : ("i", "いん"), # ~いいん
    "Ynk"   : ("a", "えん"), # ~あえん
    "IUnk"  : ("o", "いん"), # ~おいん
    "YIUnk" : ("o", "いん"), # ~おいん
    "YIAnk" : ("e", "あん"), # ~えあん
    "YIAUnk": ("o", "おん"), # ~おおん

    # nt
    "IAUnt" : ("ya", "うん"  ), # ~やうん
    "YInt"  : ("i",  "ぇん"  ), # ~いぇん
    "Ynt"   : ("ya", "いん"  ), # ~やいん
    "IUnt"  : ("yo", "いん"  ), # ~よいん
    "YIUnt" : ("yu", "いん"  ), # ~ゆいん
    "YIAnt" : ("i",  "ぇいん"), # ~いぇいん
    "YIAUnt": ("yo", "おん"  ), # ~よおん

    # tk
    "IAUtk" : ("ya", "うん"  ), # ~やいん
    "YItk"  : ("i",  "ぇっ"  ), # ~いぇっ
    "Ytk"   : ("ya",  "いっ" ), # ~やいっ
    "IUtk"  : ("yo", "いっ"  ), # ~よいん
    "YIUtk" : ("yu", "いん"  ), # ~ゆいん
    "YIAtk" : ("i",  "ぇいん"), # ~いぇいん
    "YIAUtk": ("yo", "いん"  ), # ~よいん

    # ntk
    "IAUntk" : ("a", "ーん"), # ~あーん
    "YIntk"  : ("i", "ーん"), # ~いーん
    "Yntk"   : ("ya", "ーん"),# ~やーん
    "IUntk"  : ("yo", "ーん"),# ~よーん
    "YIUntk" : ("u", "ーん"), # ~うーん
    "YIAntk" : ("e", "ーん"), # ~えーん
    "YIAUntk": ("o", "ーん"), # ~おーん
}

EXCEPTION_KANA_MAP = { # 例外的なかなのマッピング

#  |U  |YA |YI |YU |YIU|YAU|IAU|YIAU|IU  |Y   |YIA
# -|---|---|---|---|---|---|---|----|----|----|----
# F|fyu|va |vi |vu |ve |vo |vai|voi |vyu |----|----
# W|xwa|wha|wyi|iu |wye|wo |cto|ldo |ksu |----|----
# D|---|thi|---|dhu|---|dhi|---|---|----|----|----
# X|---|---|sti|---|ste|---|sta|sto |sthi|stai|stei

    # F
    "STKNU": "ふゅ",
    "STKNYA": "ゔぁ",
    "STKNYI": "ゔぃ",
    "STKNYU": "ゔ",
    "STKNYIU": "ゔぇ",
    "STKNYAU": "ゔぉ",
    "STKNIAU": "ゔぁい",
    "STKNYIAU": "ゔぉい",
    "STKNIU": "ゔゅ",

    # W
    "SKU": "うゅ",
    "SKYA": "うぁ",
    "SKYI": "ゐ",
    "SKYU": "いう",
    "SKYIU": "ゑ",
    "SKYAU": "を",
    "SKIAU": "くと",
    "SKYIAU": "るど",
    "SKIU": "くす",

    # D
    "TNYA": "てぃ",
    "TNYI": "でぃ",
    "TNYU": "でゅ",
    "TNYIU": "どぅ",
    "TNYAU": "とぅ",
    "TNYIAU": "てゅ",

    # X
    "STNYI": "すち",
    "STNYIU": "すて",
    "STNIAU": "すた",
    "STNYIAU": "すと",
    "STNIU": "すてぃ",
    "STNY": "すたい",
    "STNYIA": "すてい",
}

# 助詞のキーと対応する文字列の定義
PARTICLE_KEY_LIST = ["", "n", "t", "k", "tk", "nt", "nk", "ntk"]
# 追加音の定義
SECOND_SOUND_LIST = ["", "ん", "つ", "く", "っ", "ち", "き", "ー"]

# ドット、コンマの定義(変換コマンドはオプションです)
DOT = "。" # or "."
COMMA = "、" # or ","

# 左側の助詞文字列の定義
L_PARTICLE = ["", COMMA, "に", "の", "で", "と", "を", "へ"]

# 右側の助詞文字列の定義
R_PARTICLE = ["", COMMA, "は", "が", "も", "は" + COMMA, "が" + COMMA, "や"]

# 例外的な助詞ストロークのマッピング
EXCEPTION_STROKE_MAP = {
    "-n": "}{#Return}{", "n-": "}{#Space}{", "n-n": "}{#Tab}{",
    "-nt": DOT, "-nk": COMMA,
    "n-nt": "?", "n-nk": "!",
}
