# Mejiro設定ファイル
# 変換ロジックや辞書の設定をここで行う

# 基本子音ストロークの定義
# (変更時は配列の右側のアルファベットを変更する)
# STKN
# ストローク -> 基本子音 (s, t, k, n, r, w, h, z, d, g, b, p, m, y, f, l)
conso_stroke_to_roma = [ # (ストローク, 子音)
    ["",     '' ],
    ["S",    's'],
    ["T",    't'],
    ["K",    'k'],
    ["N",    'n'],
    ["ST",   'r'],
    ["SK",   'w'],
    ["TK",   'h'],
    ["SN",   'z'],
    ["TN",   'd'],
    ["KN",   'g'],
    ["TKN",  'b'],
    ["STK",  'p'],
    ["STN",  'l'],
    ["SKN",  'm'],
    ["STKN", 'f']
]

# 基本母音ストロークの定義 (二重母音は除外)
# (変更時は配列の右側のアルファベットを変更する)
# YIAU
# ストローク -> 基本母音 (a, i, u, e, o, ya, yu, yo)
vowel_stroke_to_roma = [ # (ストローク, 母音)
    ['A',   'a' ],
    ['I',   'i' ],
    ['U',   'u' ],
    ['IA',  'e' ],
    ['AU',  'o' ],
    ["YA",  'ya'],
    ["YU",  'yu'],
    ["YAU", 'yo']
]

# 行段のアルファベットからひらがなへのマッピング
ROMA_TO_KANA_MAP = {
    '' : ['あ',  'い',  'う',  'え',  'お',  'や',  'ゆ',  'よ'  ],
    'k': ['か',  'き',  'く',  'け',  'こ',  'きゃ','きゅ','きょ'],
    's': ['さ',  'し',  'す',  'せ',  'そ',  'しゃ','しゅ','しょ'],
    't': ['た',  'ち',  'つ',  'て',  'と',  'ちゃ','ちゅ','ちょ'],
    'n': ['な',  'に',  'ぬ',  'ね',  'の',  'にゃ','にゅ','にょ'],
    'h': ['は',  'ひ',  'ふ',  'へ',  'ほ',  'ひゃ','ひゅ','ひょ'],
    'm': ['ま',  'み',  'む',  'め',  'も',  'みゃ','みゅ','みょ'],
    'r': ['ら',  'り',  'る',  'れ',  'ろ',  'りゃ','りゅ','りょ'],
    'w': ['わ',  'うぃ','う',  'うぇ','うぉ','うぁ','う',  'を'  ],
    'g': ['が',  'ぎ',  'ぐ',  'げ',  'ご',  'ぎゃ','ぎゅ','ぎょ'],
    'z': ['ざ',  'じ',  'ず',  'ぜ',  'ぞ',  'じゃ','じゅ','じょ'],
    'd': ['だ',  'ぢ',  'づ',  'で',  'ど',  'ぢゃ','ぢゅ','ぢょ'],
    'b': ['ば',  'び',  'ぶ',  'べ',  'ぼ',  'びゃ','びゅ','びょ'],
    'p': ['ぱ',  'ぴ',  'ぷ',  'ぺ',  'ぽ',  'ぴゃ','ぴゅ','ぴょ'],
    'f': ['ふぁ','ふぃ','ゔ',  'ふぇ','ふぉ','ふゃ','ふゅ','ふょ'],
    'l': ['ぁ',  'ぃ',  'ぅ',  'ぇ',  'ぉ',  'ゃ',  'ゅ',  'ょ'  ]
}

# 二重母音ストロークの定義（親指を使うものは除外）
# YIAU
DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)
    "Y"   : ("a",  "い"), # ~あい
    "YI"  : ("yo", "う"), # ~よう
    "YIA" : ("e",  "い"), # ~えい
    "YIU" : ("yu", "う"), # ~ゆう
    "YIAU": ("u",  "う"), # ~うう
    "IU"  : ("u",  "い"), # ~うい
    "IAU" : ("o",  "う"), # ~おう
}

# 親指も使ったマイナーな二重母音のストローク定義
MINOR_DIPHTHONG_MAPPING = { # ストローク: (一文字目の母音, 二文字目)

#    |YI    |YIA   |Y     |IU      |YIU     |IAU   |YIAU    |
# ---|------|------|------|--------|--------|------|--------|
#   k|ゆい  |やい  |いい  |おい    |よい    |いぇ  |いぇい  |
#   t|うぃ  |うぇ  |あえ  |あう    |やう    |えあ  |いぇあ  |
#  nk|ゆいん|やいん|いいん|おいん  |よいん  |いぇん|いぇいん|
#  nt|うぃん|うぇん|あえん|あうん  |やうん  |えあん|いぇあん|
#  tk|うぃっ|うぇっ|いいっ|----    |----    |いぇっ|----    |
# ntk|うぃー|うぇー|いんぐ|----    |----    |いぇー|----    |

    # k
    "YIk"  : ("yu", "い"  ), # ~ゆい
    "YIAk" : ("ya", "い"  ), # ~やい
    "Yk"   : ("i",  "い"  ), # ~いい
    "IUk"  : ("o",  "い"  ), # ~おい
    "YIUk" : ("yo", "い"  ), # ~よい
    "IAUk" : ("i",  "ぇ"  ), # ~いぇ
    "YIAUk": ("i",  "ぇい"), # ~いぇい

    # t
    "YIt"  : ("u",  "ぃ"  ), # ~うぃ
    "YIAt" : ("u",  "ぇ"  ), # ~うぇ
    "Yt"   : ("a",  "え"  ), # ~あえ
    "IUt"  : ("a",  "う"  ), # ~あう
    "YIUt" : ("ya", "う"  ), # ~やう
    "IAUt" : ("e",  "あ"  ), # ~えあ
    "YIAUt": ("i",  "ぇあ"), # ~いぇあ

    # nk
    "YInk"  : ("yu", "いん"  ), # ~ゆいん
    "YIAnk" : ("ya", "いん"  ), # ~やいん
    "Ynk"   : ("i",  "いん"  ), # ~いいん
    "IUnk"  : ("o",  "いん"  ), # ~おいん
    "YIUnk" : ("yo", "いん"  ), # ~よいん
    "IAUnk" : ("i",  "ぇん"  ), # ~いぇん
    "YIAUnk": ("i",  "ぇいん"), # ~いぇいん

    # nt
    "YInt"  : ("u",  "ぃん"  ), # ~うぃん
    "YIAnt" : ("u",  "ぇん"  ), # ~うぇん
    "Ynt"   : ("a",  "えん"  ), # ~あえん
    "IUnt"  : ("a",  "うん"  ), # ~あうん
    "YIUnt" : ("ya", "うん"  ), # ~やうん
    "IAUnt" : ("e",  "あん"  ), # ~えあん
    "YIAUnt": ("i",  "ぇあん"), # ~いぇあん

    # tk
    "YItk"  : ("u",  "ぃっ"  ), # ~うぃっ
    "YIAtk" : ("u",  "ぇっ"  ), # ~うぇっ
    "Ytk"   : ("i",  "いっ"  ), # ~いいっ
    "IAUtk" : ("i",  "ぇっ"  ), # ~いぇっ

    # ntk
    "YIntk"  : ("u", "ぃー"  ), # ~うぃー
    "YIAntk" : ("u", "ぇー"  ), # ~うぇー
    "Yntk"   : ("i", "んぐ"  ), # ~いんぐ
    "IAUntk" : ("i", "ぇー"  ), # ~いぇー

}

EXCEPTION_KANA_MAP = { # 例外的なかなのマッピング

#     |U   |YA  |YI  |YU  |YIAU|YAU |
# ----|----|----|----|----|----|----|
# STKN|フュ|ヴァ|ヴィ|ヴ  |ヴェ|ヴォ|
#   SK|ゎ  |うぁ|ゐ  |いう|ゑ  |を  |
#   TN|----|ティ|トゥ|デュ|ドゥ|ディ|

    # F
    "STKNU": "ふゅ",
    "STKNYA": "ゔぁ",
    "STKNYI": "ゔぃ",
    "STKNYU": "ゔ",
    "STKNYIAU": "ゔぇ",
    "STKNYAU": "ゔぉ",

    # W
    "SKU": "ゎ",
    "SKYA": "うぁ",
    "SKYI": "ゐ",
    "SKYU": "いう",
    "SKYIAU": "ゑ",
    "SKYAU": "を",

    # D
    "TNYA": "てぃ",
    "TNYI": "とぅ",
    "TNYU": "でゅ",
    "TNYIAU": "どぅ",
    "TNYAU": "でぃ",
}

# 助詞のキーと対応する文字列の定義
PARTICLE_KEY_LIST = ["", "n", "t", "k", "tk", "nt", "nk", "ntk"]
# 追加音の定義
SECOND_SOUND_LIST = ["", "ん", "つ", "く", "っ", "ち", "き", "ー"]

# ドット、コンマの定義(変換コマンドはオプションです)
DOT = "。" # or "."
COMMA = "、" # or ","

# 左側の助詞文字列の定義
L_PARTICLE = ["", COMMA, "に", "の", "で", "と", "を", "へ"]

# 右側の助詞文字列の定義
R_PARTICLE = ["", COMMA, "は", "が", "も", "は" + COMMA, "が" + COMMA, "や"]

# 例外的な助詞ストロークのマッピング
EXCEPTION_STROKE_MAP = {
    "-n": "}{#Return}{", "n-": "}{#Space}{", "n-n": "}{#Tab}{",
    "-nt": DOT, "-nk": COMMA,
    "n-nt": "?", "n-nk": "!",
}
