# ストローク（子音・母音）からローマ字の行段アルファベットへの対応表
# STKN
conso_stroke_to_roma = [
    ["", ''], ["S", 's'], ["T", 't'], ["K", 'k'], ["N", 'n'], 
    ["ST", 'r'], ["SK", 'w'], ["TK", 'h'],
    ["SN", 'z'], ["TN", 'd'], ["KN", 'g'], ["TKN", 'b'],
    ["STK", 'p'], ["STN", 'l'], ["SKN", 'm'], ["STKN", 'f']
]

# 基本母音ストロークの定義 (二重母音は除外)
# ストローク -> 基本母音 (a, i, u, e, o, ya, yu, yo)
vowel_stroke_to_roma = [
    ['A', 'a'], ['I', 'i'], ['U', 'u'], ['IA', 'e'], ['AU', 'o'],
    ["YA", 'ya'], ["YU", 'yu'], ["YAU", 'yo']
]

# Key: ストローク, Value: (基本母音ローマ字, 長音文字)
# YIAU
DIPHTHONG_MAPPING = {
    "Y": ("a", "い"),
    "YI": ("yo", "う"),
    "YIA": ("e", "い"),
    "YIU": ("yu", "う"),
    "YIAU": ("u", "う"),
    "IU": ("u", "い"),
    "IAU": ("o", "う"),
}
# 親指も使った二重母音(n)
COMPLEX_DIPHTHONG_MAPPING = {
    "YIn": ("i", "い"),
    "YIUn": ("a", "え"),
    "IAUn": ("o", "お"),
    "YIAUn": ("o", "い"),
}

# 行段のアルファベットからひらがなへのマッピング (変更なし)
ROMA_TO_KANA_MAP = {
    '':  ['あ', 'い', 'う', 'え', 'お', 'や', 'ゆ', 'よ'],
    'k': ['か', 'き', 'く', 'け', 'こ', 'きゃ', 'きゅ', 'きょ'],
    's': ['さ', 'し', 'す', 'せ', 'そ', 'しゃ', 'しゅ', 'しょ'],
    't': ['た', 'ち', 'つ', 'て', 'と', 'ちゃ', 'ちゅ', 'ちょ'],
    'n': ['な', 'に', 'ぬ', 'ね', 'の', 'にゃ', 'にゅ', 'にょ'],
    'h': ['は', 'ひ', 'ふ', 'へ', 'ほ', 'ひゃ', 'ひゅ', 'ひょ'],
    'm': ['ま', 'み', 'む', 'め', 'も', 'みゃ', 'みゅ', 'みょ'],
    'r': ['ら', 'り', 'る', 'れ', 'ろ', 'りゃ', 'りゅ', 'りょ'],
    'w': ['わ', 'うぃ', 'ゔ', 'うぇ', 'を', 'やあ', 'いう', 'うぉ'],
    'g': ['が', 'ぎ', 'ぐ', 'げ', 'ご', 'ぎゃ', 'ぎゅ', 'ぎょ'],
    'z': ['ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'じゃ', 'じゅ', 'じょ'],
    'd': ['だ', 'ぢ', 'づ', 'で', 'ど', 'でぃ', 'てぃ', 'どぅ'],
    'b': ['ば', 'び', 'ぶ', 'べ', 'ぼ', 'びゃ', 'びゅ', 'びょ'],
    'p': ['ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ぴゃ', 'ぴゅ', 'ぴょ'],
    'f': ['ふぁ', 'ふぃ', 'ふ', 'ふぇ', 'ふぉ', 'じぇ', 'しぇ', 'ちぇ'],
    'l': ['ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ', 'ゃ', 'ゅ', 'ょ']
}

# 母音のローマ字と対応するインデックス（段）のマッピング
VOWEL_INDEX_MAP = {
    'a': 0, 'i': 1, 'u': 2, 'e': 3, 'o': 4,
    'ya': 5, 'yu': 6, 'yo': 7
}